In [9]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 10.1 DataFrame 다루기

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('py10p01.csv'); df

   Name      Data Class  Mark Gender   Age
0   Bob  20090101     A    90      M  23.0
1  Jane  20090102     b    85      F  21.0
2   Tom  20090103     B    67      M  22.0
3  Mary  20090104     a    72      F   NaN
4   Tom  20090103     B    67      M  22.0

In [3]:
df.head

<bound method NDFrame.head of    Name      Data Class  Mark Gender   Age
0   Bob  20090101     A    90      M  23.0
1  Jane  20090102     b    85      F  21.0
2   Tom  20090103     B    67      M  22.0
3  Mary  20090104     a    72      F   NaN
4   Tom  20090103     B    67      M  22.0>

In [4]:
df.tail

<bound method NDFrame.tail of    Name      Data Class  Mark Gender   Age
0   Bob  20090101     A    90      M  23.0
1  Jane  20090102     b    85      F  21.0
2   Tom  20090103     B    67      M  22.0
3  Mary  20090104     a    72      F   NaN
4   Tom  20090103     B    67      M  22.0>

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Data    5 non-null      int64
 2   Class   5 non-null      object
 3   Mark    5 non-null      int64
 4   Gender  5 non-null      object
 5   Age     4 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 368.0+ bytes

In [6]:
#(a)
df.loc[1]

Name          Jane
Data      20090102
Class            b
Mark            85
Gender           F
Age           21.0
Name: 1, dtype: object

In [7]:
df.loc[[1,3]]

   Name      Data Class  Mark Gender   Age
1  Jane  20090102     b    85      F  21.0
3  Mary  20090104     a    72      F   NaN

In [10]:
df['Mark']; df.Mark

0    90
1    85
2    67
3    72
4    67
Name: Mark, dtype: int64

0    90
1    85
2    67
3    72
4    67
Name: Mark, dtype: int64

In [11]:
df[['Name','Mark']]

   Name  Mark
0   Bob    90
1  Jane    85
2   Tom    67
3  Mary    72
4   Tom    67

In [12]:
df.loc[2]['Name']; df.loc[2].Name; df['Name'][2]; df.Name[2]

'Tom'

'Tom'

'Tom'

'Tom'

In [13]:
df.loc[1:4,'Class':'Gender']

  Class  Mark Gender
1     b    85      F
2     B    67      M
3     a    72      F
4     B    67      M

In [14]:
df[['Class','Mark','Gender']][1:4]

  Class  Mark Gender
1     b    85      F
2     B    67      M
3     a    72      F

In [19]:
df[(df['Class']=='A')&(df['Mark']>=90)]

  Name      Data Class  Mark Gender   Age
0  Bob  20090101     A    90      M  23.0

In [20]:
#(b)
df = df.drop_duplicates(); df

   Name      Data Class  Mark Gender   Age
0   Bob  20090101     A    90      M  23.0
1  Jane  20090102     b    85      F  21.0
2   Tom  20090103     B    67      M  22.0
3  Mary  20090104     a    72      F   NaN

In [21]:
#(c)
dfc = df.set_index('Name'); dfc

          Data Class  Mark Gender   Age
Name
Bob   20090101     A    90      M  23.0
Jane  20090102     b    85      F  21.0
Tom   20090103     B    67      M  22.0
Mary  20090104     a    72      F   NaN

In [22]:
#(d)
dfd1 = dfc.sort_index(); dfd1

          Data Class  Mark Gender   Age
Name
Bob   20090101     A    90      M  23.0
Jane  20090102     b    85      F  21.0
Mary  20090104     a    72      F   NaN
Tom   20090103     B    67      M  22.0

In [27]:
dfd2 = dfc.sort_index(ascending=False); dfd2

          Data Class  Mark Gender   Age
Name
Tom   20090103     B    67      M  22.0
Mary  20090104     a    72      F   NaN
Jane  20090102     b    85      F  21.0
Bob   20090101     A    90      M  23.0

In [30]:
#(e)
dfe1 = dfc.sort_values(by=4);dfe1

KeyError: 4